// [WinAPI] Реализовать функцию WndProc оконного приложения WinAPI.
// В главном окне приложения находятся фигуры (круги, квадраты,
// правильные треугольники, правильные пятиугольники; при запуске
// приложения количество фигур и их параметры генерируются
// псевдослучайно). При нажатии левой кнопкой мыши по фигуре, фигура
// становится “выбранной”, при этом меняются цвета её границы и заливки.
// По нажатию кнопок “+”, “-” на клавиатуре, или же пунктов меню “+”, “-”,
// можно изменять размер выбранной фигуры. При нажатии на область окна,
// в которой нет фигур, выделение спадает.